ghsecuritylab/stm32_linux/Projects/udemy/Packages/.cache/AnalogDevices.ADuCM302x_DFP.1.0.4.pdsc
		<component Cclass="Device" Cgroup="Services" Csub="TMR" Cversion="1.0.0" condition="ADuCM302x Driver">
			<description>GP Timer</description>
			<files>
				<file category="source" name="Source/services/tmr/adi_tmr.c"/>
				<file category="header" name="Include/config/adi_tmr_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___g_p___timer___service.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Services" Csub="WDT" Cversion="1.0.0" condition="ADuCM302x Driver">
			<description>WDT</description>
			<files>
				<file category="source" name="Source/services/wdt/adi_wdt.c"/>
				<file category="header" name="Include/config/adi_wdt_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___w_d_t___service.html"/>
			</files>
		</component>

		<!-- Drivers -->
		<component Cclass="Device" Cgroup="Drivers" Csub="ADXL363" Cversion="1.0.0" condition="ADuCM302x ADXL363">
			<description>ADXL363</description>
			<files>
				<file category="source" name="Source/drivers/accel/adxl363/adi_adxl363.c"/>
				<file category="header" name="Include/config/adi_adxl363_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group__adxl363___driver.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Drivers" Csub="ADC" Cversion="1.0.0" condition="ADuCM302x ADC">
			<description>ADC</description>
			<files>
				<file category="source" name="Source/drivers/adc/adi_adc.c"/>
				<file category="header" name="Include/config/adi_adc_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___a_d_c___driver.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Drivers" Csub="BEEP" Cversion="1.0.0" condition="ADuCM302x Driver">
			<description>BEEP</description>
			<files>
				<file category="source" name="Source/drivers/beep/adi_beep.c"/>
				<file category="header" name="Include/config/adi_beep_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___b_e_e_p___driver.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Drivers" Csub="CRC" Cversion="1.0.0" condition="ADuCM302x Driver">
			<description>CRC</description>
			<files>
				<file category="source" name="Source/drivers/crc/adi_crc.c"/>
				<file category="header" name="Include/config/adi_crc_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___c_r_c___driver.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Drivers" Csub="Crypto" Cversion="1.0.0" condition="ADuCM302x Crypto">
			<description>Crypto</description>
			<files>
				<file category="source" name="Source/drivers/crypto/adi_crypto.c"/>
				<file category="header" name="Include/config/adi_crypto_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___crypto___driver.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Drivers" Csub="Flash" Cversion="1.0.0" condition="ADuCM302x Flash">
			<description>Flash Controller</description>
			<files>
				<file category="source" name="Source/drivers/flash/adi_flash.c"/>
				<file category="header" name="Include/config/adi_flash_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___flash___driver.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Drivers" Csub="I2C" Cversion="1.0.0" condition="ADuCM302x I2C">
			<description>I2C</description>
			<files>
				<file category="source" name="Source/drivers/i2c/adi_i2c.c"/>
				<file category="header" name="Include/config/adi_i2c_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___i2_c___driver.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Drivers" Csub="RNG" Cversion="1.0.0" condition="ADuCM302x Driver">
			<description>RNG</description>
			<files>
				<file category="source" name="Source/drivers/rng/adi_rng.c"/>
				<file category="header" name="Include/config/adi_rng_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___r_n_g___driver.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Drivers" Csub="SPI" Cversion="1.0.0" condition="ADuCM302x SPI">
			<description>SPI</description>
			<files>
				<file category="source" name="Source/drivers/spi/adi_spi.c"/>
				<file category="header" name="Include/config/adi_spi_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___s_p_i___driver.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Drivers" Csub="SPORT" Cversion="1.0.0" condition="ADuCM302x SPORT">
			<description>SPORT</description>
			<files>
				<file category="source" name="Source/drivers/sport/adi_sport.c"/>
				<file category="header" name="Include/config/adi_sport_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___s_p_o_r_t___driver.html"/>
			</files>
		</component>

		<component Cclass="Device" Cgroup="Drivers" Csub="UART" Cversion="1.0.0" condition="ADuCM302x UART">
			<description>UART</description>
			<files>
				<file category="source" name="Source/drivers/uart/adi_uart.c"/>
				<file category="header" name="Include/config/adi_uart_config.h" version="1.0.0" attr="config"/>
				<file category="doc" name="Docs/html/group___u_a_r_t___driver.html"/>
			</files>
		</component>

	</components>

	<boards>
		<board vendor="AnalogDevices" name="ADuCM3029 EZ-BOARD" revision="Ver 1.0">
			<description>Analog Devices ADuCM3029 Evaluation Board</description>
			<mountedDevice    deviceIndex="0" Dvendor="Analog Devices:1" Dname="ADuCM3029"/>
			<compatibleDevice deviceIndex="0" Dvendor="Analog Devices:1" Dfamily="ADuCM302x Series"/>
			<feature type="PWR"             n="5"              name="External 5.0VDC/3.6A power supply"/>
			<debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
		</board>
	</boards>

	<examples>
		<example name="HelloWorld" doc="Readme_HelloWorld.txt" folder="Boards/ADuCM3029-EZ-Board/Keil/HelloWorld" version="1.0.0">
			<description>Hello World</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="uv" load="HelloWorld.uvprojx"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Retarget"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="UART"/>
				<component Cclass="Device" Cgroup="Services" Csub="DMA"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
			</attributes>
		</example>

		<example name="HelloWorld" doc="Readme_HelloWorld.txt" folder="Boards/ADuCM3029-EZ-Board/CCES/HelloWorld" version="1.0.0">
			<description>Hello World</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="cces" load=".project"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
			</attributes>
		</example>

		<example name="Beep" doc="Readme_beep_example.txt" folder="Boards/ADuCM3029-EZ-Board/Keil/beep" version="1.0.0">
			<description>Audible Beep</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="uv" load="beep_example.uvprojx"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Retarget"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="BEEP"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="UART"/>
				<component Cclass="Device" Cgroup="Services" Csub="DMA"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

		<example name="Beep" doc="Readme_beep_example.txt" folder="Boards/ADuCM3029-EZ-Board/CCES/beep" version="1.0.0">
			<description>Audible Beep</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="cces" load=".project"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Examples Support"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="BEEP"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

		<example name="CRC" doc="Readme_crc_example.txt" folder="Boards/ADuCM3029-EZ-Board/Keil/crc" version="1.0.0">
			<description>CRC driver usage</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="uv" load="crc_example.uvprojx"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Retarget"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="CRC"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="UART"/>
				<component Cclass="Device" Cgroup="Services" Csub="DMA"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

		<example name="CRC" doc="Readme_crc_example.txt" folder="Boards/ADuCM3029-EZ-Board/CCES/crc" version="1.0.0">
			<description>CRC driver usage</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="cces" load=".project"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Examples Support"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="CRC"/>
				<component Cclass="Device" Cgroup="Services" Csub="DMA"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

