ghsecuritylab/stm32_linux/Projects/udemy/Packages/.cache/AnalogDevices.ADuCM302x_DFP.1.0.4.pdsc
		<example name="Crypto" doc="Readme_crypto_example.txt" folder="Boards/ADuCM3029-EZ-Board/Keil/crypto" version="1.0.0">
			<description>Crypto driver usage</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="uv" load="crypto_example.uvprojx"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Retarget"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="Crypto"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="UART"/>
				<component Cclass="Device" Cgroup="Services" Csub="DMA"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

		<example name="Crypto" doc="Readme_crypto_example.txt" folder="Boards/ADuCM3029-EZ-Board/CCES/crypto" version="1.0.0">
			<description>Crypto driver usage</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="cces" load=".project"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Examples Support"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="Crypto"/>
				<component Cclass="Device" Cgroup="Services" Csub="DMA"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

		<example name="LED_Button_Callback" doc="Readme_LED_button_callback.txt" folder="Boards/ADuCM3029-EZ-Board/Keil/gpio/LED_button_callback" version="1.0.0">
			<description>GPIO using callbacks from interrupt handler</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="uv" load="LED_button_callback.uvprojx"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Retarget"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="UART"/>
				<component Cclass="Device" Cgroup="Services" Csub="GPIO"/>
				<component Cclass="Device" Cgroup="Services" Csub="DMA"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

		<example name="LED_Button_Callback" doc="Readme_LED_button_callback.txt" folder="Boards/ADuCM3029-EZ-Board/CCES/gpio/LED_button_callback" version="1.0.0">
			<description>GPIO using callbacks from interrupt handler</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="cces" load=".project"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Examples Support"/>
				<component Cclass="Device" Cgroup="Services" Csub="GPIO"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

		<example name="LED_Button_Polled" doc="Readme_LED_button_polled.txt" folder="Boards/ADuCM3029-EZ-Board/Keil/gpio/LED_button_polled" version="1.0.0">
			<description>GPIO polling to test state</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="uv" load="LED_button_polled.uvprojx"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Retarget"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="UART"/>
				<component Cclass="Device" Cgroup="Services" Csub="GPIO"/>
				<component Cclass="Device" Cgroup="Services" Csub="DMA"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

		<example name="LED_Button_Polled" doc="Readme_LED_button_polled.txt" folder="Boards/ADuCM3029-EZ-Board/CCES/gpio/LED_button_polled" version="1.0.0">
			<description>GPIO polling to test state</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="cces" load=".project"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Examples Support"/>
				<component Cclass="Device" Cgroup="Services" Csub="GPIO"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

		<example name="Random Number Generation" doc="Readme_rng_example.txt" folder="Boards/ADuCM3029-EZ-Board/Keil/rng" version="1.0.0">
			<description>Random Number Generation using the RNG accelerator</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="uv" load="rng_example.uvprojx"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Retarget"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="RNG"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="UART"/>
				<component Cclass="Device" Cgroup="Services" Csub="DMA"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

		<example name="Random Number Generation" doc="Readme_rng_example.txt" folder="Boards/ADuCM3029-EZ-Board/CCES/rng" version="1.0.0">
			<description>Random Number Generation using the RNG accelerator</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="cces" load=".project"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Examples Support"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="RNG"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

		<example name="SysTick" doc="Readme_systick_example.txt" folder="Boards/ADuCM3029-EZ-Board/Keil/systick" version="1.0.0">
			<description>SysTick verification</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="uv" load="SysTick.uvprojx"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Retarget"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="UART"/>
				<component Cclass="Device" Cgroup="Services" Csub="GPIO"/>
				<component Cclass="Device" Cgroup="Services" Csub="DMA"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>


		<example name="SysTick" doc="Readme_systick_example.txt" folder="Boards/ADuCM3029-EZ-Board/CCES/systick" version="1.0.0">
			<description>SysTick verification</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="cces" load=".project"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Examples Support"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

		<example name="UART_Autobaud" doc="Readme_autobaud.txt" folder="Boards/ADuCM3029-EZ-Board/CCES/uart/autobaud" version="1.0.0">
			<description>UART Baud rate detection</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="cces" load=".project"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Examples Support"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="UART"/>
				<component Cclass="Device" Cgroup="Services" Csub="DMA"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>

		<example name="UART_Loopback" doc="Readme_uart_loopback.txt" folder="Boards/ADuCM3029-EZ-Board/CCES/uart/uart_loopback" version="1.0.0">
			<description>UART input/output via loopback</description>
			<board name="ADuCM3029 EZ-BOARD" vendor="AnalogDevices" Dname="ADuCM3029"/>
			<project>
				<environment name="cces" load=".project"/>
			</project>
			<attributes>
				<category>Getting Started</category>
				<component Cclass="CMSIS"  Cgroup="CORE"/>
				<component Cclass="Device" Cgroup="Startup"/>
				<component Cclass="Device" Cgroup="Examples Support"/>
				<component Cclass="Device" Cgroup="Drivers" Csub="UART"/>
				<component Cclass="Device" Cgroup="Services" Csub="DMA"/>
				<component Cclass="Device" Cgroup="Services" Csub="Power"/>
				<component Cclass="Device" Cgroup="Services" Csub="WDT"/>
			</attributes>
		</example>


